<template>
  <div class="history-division">
      <div class="timeline">
          <a-timeline pending=" ">
              <a-timeline-item color="rgba(171, 117, 42)"><a href="#historic">秦汉时期，秦晋方言和赵魏方言的分化</a></a-timeline-item>
              <a-timeline-item color="rgba(171, 117, 42)"><a href="#jin">唐宋时期方言的分化</a></a-timeline-item>
              <a-timeline-item color="rgba(171, 117, 42)"><a href="#fight">权威方言对晋语的影响</a></a-timeline-item>
          </a-timeline>
          <div class="bgc">
            <el-color-picker v-model="color1">选择颜色</el-color-picker>
            <br>
            <a-button icon="check" size="small"  @click="finishEdit()">
            </a-button>
        </div>
      </div>
      <a-drawer
        title="笔记"
        placement="right"
        :closable="true"
        :visible="visible"
        :after-visible-change="afterVisibleChange"
        @close="onClose">
        <a-card v-for="(item, i) in editList" :key="i">
          <p :style="{color: colors[i]}">{{item}}</p>
        </a-card>
      </a-drawer>
      <div class="content">
          <h3 id="historic">秦汉时期，秦晋方言和赵魏方言的分化
          </h3>
          <img src="../assets/dialect.png" alt="" align="right" width="250" hspace="5" vspace="5">
          <p v-for="(count,index) in firstDivisionContent" :id="first(index)">{{count}}</p>
          <h3 id="jin">唐宋时期方言的分化</h3>
          <p v-for="(count,index) in secondDivisionContent" :id="second(index)">{{count}}</p>
          <h3 id="fight">权威方言对晋语的影响</h3>
          <p v-for="(count,index) in thirdDivisionContent" :id="third(index)">{{count}}</p>
          </div>
  </div>
</template>
<script>
import {Message} from 'element-ui'
export default {
  data () {
    return {
      visible: false,
      color1: '#000',
      colors: [],
      firstDivisionContent: [
        '秦晋方言。秦、晋两国语言同为黄帝时华夏语、周秦时的雅言的基础方言，在早期应该是有很大的共同之处的。到了战国时期，晋国的分裂拉动了普语内部的分化。秦统六国后，山西设六郡:河东、太原、上党、云中、雁门、代郡，这六郡也大致与今山西境内方言片相合。西汉时，河东与京师等地共隶属于司隶校尉部。太原、上党、云中、定襄、雁门、代郡隶属于并州刺史部。这种行政区划进一步加深了河东方言和山西其他方言的差异。今晋西南一带(古晋国和古晋语的发源地)与秦地相邻，来往密切，逐渐形成秦晋方言，赵魏两地在由晋西南向东、向北的扩张过程中，语言面貌逐渐与古晋语形成差异。山西《临晋县志》记载:“盖自秦汉以来，内史三辅而外，以河东为首都，临邑当时逼进西京，语言文字犹近于雅，迄永嘉南渡，五部分居，音之变易弥多矣。”《左传·文公十三年》中有一条材料可以证明当时秦、魏的方言难于相通。《左传》该处先述六卿谋划于诸浮，使魏寿余伪以魏叛者诱士会还晋，而后说:“秦伯师于河西，魏人在东，寿余日，请东人之能与夫二三有司言者，无与之先。便士会。”士会是东人，能说东边魏地的话，所以秦人不得不派他去。这一段话说明当时秦、魏之间的方言差异还很大，通话不便，所以魏人才有可能借要通话诱使“士会还晋”。《方言》一书材料的来源既有扬雄自已通过方言调查收集的资料，也有其同乡严君平收罗的从国家图书馆散失出来的前余字的资料以及他本人在国家图书馆看到的前入收集的方言材料，《方言》里提到的前代国名地名应该和这些材料有关，所以这些材料可能反映了更为早期的方言面貌。《方言》里面有一些秦、晋对举的材料，也可以说明两地的语言差异。如:',
        '虔、儇，慧也。秦谓之谩，晋谓之想。(第一）台，陶，养也。晋卫燕魏日台，秦或日陶。（同上)結、擊，特也。晋日結，秦曰挈。(第六)',
        '娥，好也。秦曰娥。秦晋之间凡好谓之娥。自关而西秦晋而轻者之故都日妍。 (郭璞注:“秦旧都今扶风雍丘也。晋旧都今太原晋阳县也。”) (第一)(注:《方言》据四部丛刊影印南宋李孟传刻本。)',
        '到秦汉时期，秦、晋方言已成为一个整体。《方言》中，秦出现109次，秦晋并举88次，并举占到了81%。但是需要指出，《方言》中的“晋”并不是指山西全境，而是指晋国初兴时的主要区域，即山西南部运城、临汾地区。',
        '秦晋方言的形成原因是多方面的。',
        '第一，秦、晋两国有很深的历史渊源，在各自的发展中又来往不断。据载，秦国的先祖就曾是由“西垂”(今甘肃天水市西南)迁入河东的移民，居住在赵城一带，即今洪洞赵城镇。后一支水久居住在河东地区，成为显赫的赵氏家族，另支在周孝王时被封于秦，离开了河东。这种亲密的历史渊源为秦晋两国的关系营造了特殊的氛围。',
        '第二，秦晋间自上而下的迁移非常频繁。由于两国的密切交往关系和地缘上的便利，秦国成为三晋之人外迁的主要去处。这种迁移有三种类型:①秦孝公即位之前以两地间人口的自由迁移为主:②商鞅变法时，招徕三晋之民入秦垦荒;③秦汉时期有所谓“实关中”。',
        '第三，政治经济、历史文化的地缘向心力。秦统六国后，关中地区成为全国的政治、经济、文化中心，对晋南产生了很大的影响，从而使晋南在文化、方言等方面都向其靠拢。秦以后的行政区划进”步巩固了这种靠视的趋向。',
        '第四，便利的交通为两国的来往交流提供了条件.晋南地近三秦，虽与关中地区隔黄河相望，但从北至南有禹门口、夹马口、风陵渡、茅津渡等古渡口和“汾河—黄河—渭河”水路相通，所以秦、晋之间的人口往来、商贸往来不断。',
        '赵魏方言。《方言》中，赵魏的关系很密切，赵提到35次，其中与魏并举就达18次。说明秦汉时期赵魏方言有很大的一致性。一方面，赵魏方言同出于古晋语，其方言具有一致性是很自然的。另一方面，赵魏两地相邻，其间交通非常方便，两地往来较多，所以尽管两地分属不同国家，其语言仍保持了较强的一致性。历来的学者都将秦、晋划为一个方言区，将赵、魏也划为一个方言区。',
        '尽管这一时期山西境内的方言是秦晋方言和赵魏方言，但同时也应注意到赵魏方言内部的差异。赵地领土广袤，其北部与燕代方言接触较多，南部则与魏地接近。所以，虽然赵魏是一个方言区，因幅员过于辽阔，又有外族影响，内部差异还是较大。这种差异一直延续至唐宋时期。'
      ],
      secondDivisionContent: [
        '从行政区划来看，山西河东和并州分立的这种行政区划被历代沿袭下来加以巩固。曹魏郡国建制与汉略同。河东与平阳、河内、河南、原武、弘农、野王属司隶州，太原、上党、乐平、西河、雁门、新兴属并州。西晋统-后其建制为河东，平阳等十二郡属司州。太原、上党、雁门等四郡二国属并州。可以看出，近500余年内河东郡与京师、河南等地同属一个管辖范围，其他六片始终为一个管辖范围。自此可知，河东片方言当与长安、洛阳地区方言接近;并州等其他几个方言片关系紧密:河东、平阳与晋方言的其他片差异拉大。',
        '唐初因隋旧制，设河东道，辖二府十九州，二所为河中府(蒲州)、太原府(并州)北宋除将山西南部的河中府解州等与京兆向归永兴军路外，其余全为太原府归河东路。晋南大部分归太原府时间相对要短。辽金后太原、平阳基本上是分多合少。 从文化格局来看，自秦汉以降，山西境内的文化演变方向是南北各以河东和 并州为中心逐渐趋同。据安介生(1999)，秦汉时期，山西境内的文化区可分为(1)河东区，包括今临汾和运城地区。这一地区紧邻关中，有悠久的历史文化 传统，以耕作为主。(2)太原与上党区，包括今太原市区、晋中、晋东南地区。这些区域在战国时期为赵国辖境，有悲歌慷慨、使气尚义之风，农业生产不发达。(3)雁门与代郡区，包括今雁北与忻州地区。这一区域战国时也属赵国。因其毗邻游牧民族聚居的北方大草原，所以农牧业并重。(4)西河区，包括今吕梁大部，与雁代地区相类，受游牧民族熏染，畜牧业占很大比例。',
        '隋唐时期，山西境内的文化布局是:(1)长平上党区，今晋东南地区;(2)河东西河区，今运城、临汾两地区以及吕梁地区的一部分;(3)太原区，今晋中地区大部; (4)离石雁门马邑楼烦区，包括今吕梁地区大部以及雁北、忻州两区。虽有四区，但有明显的趋同性。北宋时期，地缘趋同性更为明显。据《太平寰宇记》的记载，并州、汾州、石州风俗相同，忻州、代州、岚州、蔚州习尚一致，而代州又与并州风俗略同，这些区域实际上形成了一个以并州为核心的风俗区。北部、西部深染少数民族文化。南部则另为一个文化区，保持传统农业文化特征，与中原文化同。中部风俗则具有双重性。但从有关资料来看，中部与北部风俗更为接近。',
        '自秦汉以来，晋南地区即河东地区一直是一个整体，而北部、中西部、东南部则一直存在差异，经魏晋南北朝的民族融合，到唐宋时期，北部、中西部、东南部的差异逐渐减少，共性逐渐增多，成为一个文化区。',
        '文化格局与方言格局有着关联性。这一时期山西方言的特点主要体现为以并州为中心的中北部方言形成，与以运城、临汾为中心的南部方言对峙。前者可以称为并州方言，后者可以称为河东方言。而这种格局正是今天山西境内方言的基本格局:晋语区与中原官话区并存。这种格局自战国时期三家分晋肇端，经秦汉时期发展巩固，至唐宋时期已基本定型，延续至今。'
      ],
      thirdDivisionContent: [
        '早在夏商时期，洛阳带就是中华民族的活动中心。周建都镐京，但是洛阳仍是当时的政治、文化中心之一，所以周公旦才在洛阳建立东都，以便控制全国。 平王东迁，洛阳更是各诸侯国朝聘会盟之所。各诸侯国的语言不样， 出于交际的需要，他们采用洛阳王室语言作为共同语。这种共同语在当时叫"雅言"，《论语.述而》说:“子所雅言，詩、書、執禮，皆雅言也。”东汉一直定都洛阳，当时已经出现了反切，像郑玄、许慎等大儒为经典所作的音注就是根据洛阳太学的标准音。扬雄《方言》用“通語”、“凡言"的名称。晋代郭璞的《方言注》中提到“四方通语”。唐李涪《刊误》说:“凡中原音切，莫過東都”，东都就是洛阳。宋陆游《老学庵笔记》说:“中原惟洛陽得天地之中，語音最正。”元代周德清则说:“唯我圣朝，兴自北方，五十余年，言语之间，必以中原之音为正”。这些都说明当时的洛阳话确实起到共同语的作用。',
        '总的说来，中原-带自古以来就是汉族先民繁衍生息之地。三代以降，秦汉魏晋以至唐宋，中原地区一直是我国政治文化的中心区域。其间虽伴随着改朝换代、国都的迁移而导致基础方言代表点口语音的迁移变化和基础方言区的扩大，但中原地区始终是汉语基础方言的中心地区。洛阳话作为-种权威方言到宋元之际一直未变。潘悟云师(2000)指出历史上长安和洛阳的关系非常密切，两处方言具有一致性，古代以洛阳为中心的方言区包括长安。',
        '山西西南一带与长安、洛阳地区相邻，中原音自然会对山西方言不断渗透、侵蚀，从而使山西方言向其靠拢。',
        '元明清三代北京音借助政治经济文化的力量而崛起，到清代有了“国朝建都于燕，天下语音首尚京音”的呼声，北京音成为新的权威方言开始对各地方言发挥作用，山西是白话通俗文学发达的地区，自然更是深受影响。经过漫长的历史时期，山西方言自身的特点在不断萎缩。只是由于山西地势封闭，东亘太行山，南临黄河，同时山西境内多山、沟壑、盆地，这些天然屏障使晋语保持了较强的稳定性，并给晋语独立发展演变留下了空间，所以今天的山西方言才会保留有较多的古代特征，同时在某些方面演变又快于北方话，成为一种很有特点的方言。总的说来，山西方言内部并州方言与河东方言的格局基本形成，从整体上来讲，又不断受到权威方言的影响。'
      ],
      editList: []
    }
  },
  methods: {
    afterVisibleChange (val) {
      console.log('visible', val)
    },
    showDrawer () {
      this.colors.push(this.color1)
      this.visible = true
    },
    onClose () {
      this.visible = false
    },
    getMessage (path) {
      const params = new URLSearchParams()
      params.append('page',"division")
      this.$http.post(path, params)
        .then(res => {
          console.log(res.data.data.length)
          for(let i=0;i<res.data.data.length;i++){
            if(res.data.data[i].contents !== ''){
              this.colors.push(res.data.data[i].color)
              this.editList.push(res.data.data[i].contents)
            }
          }
        })
    },
    reviseInnerText (path) {
      const params = new URLSearchParams()
      params.append('page',"division")
      params.append('contents', this.editList[this.editList.length-1])
      params.append('color', this.colors[this.editList.length-1])
      this.$http.post(path, params)
        .then(res => {
          if (res.data === 'no') {
            Message.error('添加失败')
          } else {
            Message({
              message: '添加成功',
              type: 'success'
            })
          }
        })
        .catch(() => {
          console.log('错误')
        })
    },
    finishEdit () {
      const str = document.getSelection().toString()
      let judge = true;
      for(const item in this.editList){
        if(this.editList[item] == str){
          judge = false;
          break;
        }
      }
      if(str.length>=300){
        judge = false
      }
      let post = true
      if(str.length==0 || str == '\n' || str == ''){
        post = false
      }
      if(judge){
        this.showDrawer()
        if(post){
          this.editList.push(str)
          this.reviseInnerText('/display/history/reviseContent/')
        }
      }
      else{
        Message({
              message: '添加失败',
              type: 'error'
        })
      }
    },
    first (index) {
      return 'first' + index
    },
    second (index) {
      return 'second' + index
    },
    third (index) {
      return 'third' + index
    }
  },
  created: function () {
    this.getMessage('/display/history/getMessage/')
  }
}
</script>
<style src="../style/history.css" scoped></style>
